#!/usr/bin/env python3

# '''
# 求解《百钱百鸡》问题
# 1只公鸡5元 1只母鸡3元 3只小鸡1元 用100元买100只鸡
# 问公鸡 母鸡 小鸡各有多少只
#     -- 穷举法
# '''

# for a in range(20):
#     for b in range(32):
#         c = 100-a-b
#         if 5*a+3*b+1/3*c==100 :
#             print('公鸡%d只 母鸡%d只 小鸡%d只' % (a,b,c))

# '''
# 输出斐波那契数列的前20个数
# 1 1 2 3 5 8 13 21 ...
#     -- 元组(tuple)多元赋值
# '''
# a=0
# b=1
# for _ in range(20):
#     (a,b)=(b,a+b)
#     print(a,end=' ')

'''
找出100~999之间的所有水仙花数
水仙花数是各位立方和等于这个数本身的数
如: 153 = 1**3 + 5**3 + 3**3
    -- 地板除运算符(//): 先做除法(/)，然后向下取整(floor)
    -- a = 485 // 100  ## a==4
'''
for i in range(100, 1000):
    a = int(i/100)
    b = int((i-100*a)/10)
    c = i-100*a-10*b
    if a**3+b**3+c**3 == i:
        print(i, end=' ')
